[
    {
        "title": "Machine Learning Applications In Healthcare: The State Of Knowledge and\n  Future Directions",
        "authors": [
            "Mrinmoy Roy",
            "Sarwar J. Minar",
            "Porarthi Dhar",
            "A T M Omor Faruq"
        ],
        "summary": "  Detection of easily missed hidden patterns with fast processing power makes\nmachine learning (ML) indispensable to today's healthcare system. Though many\nML applications have already been discovered and many are still under\ninvestigation, only a few have been adopted by current healthcare systems. As a\nresult, there exists an enormous opportunity in healthcare system for ML but\ndistributed information, scarcity of properly arranged and easily explainable\ndocumentation in related sector are major impede which are making ML\napplications difficult to healthcare professionals. This study aimed to gather\nML applications in different areas of healthcare concisely and more effectively\nso that necessary information can be accessed immediately with relevant\nreferences. We divided our study into five major groups: community level work,\nrisk management/ preventive care, healthcare operation management, remote care,\nand early detection. Dividing these groups into subgroups, we provided relevant\nreferences with description in tabular form for quick access. Our objective is\nto inform people about ML applicability in healthcare industry, reduce the\nknowledge gap of clinicians about the ML applications and motivate healthcare\nprofessionals towards more machine learning based healthcare system.\n",
        "id": "http://arxiv.org/abs/2307.14067v1",
        "published": "2023-07-26T09:34:34Z"
    },
    {
        "title": "Probabilistic Machine Learning for Healthcare",
        "authors": [
            "Irene Y. Chen",
            "Shalmali Joshi",
            "Marzyeh Ghassemi",
            "Rajesh Ranganath"
        ],
        "summary": "  Machine learning can be used to make sense of healthcare data. Probabilistic\nmachine learning models help provide a complete picture of observed data in\nhealthcare. In this review, we examine how probabilistic machine learning can\nadvance healthcare. We consider challenges in the predictive model building\npipeline where probabilistic models can be beneficial including calibration and\nmissing data. Beyond predictive models, we also investigate the utility of\nprobabilistic machine learning models in phenotyping, in generative models for\nclinical use cases, and in reinforcement learning.\n",
        "id": "http://arxiv.org/abs/2009.11087v1",
        "published": "2020-09-23T12:14:05Z"
    },
    {
        "title": "Reliable and Resilient AI and IoT-based Personalised Healthcare\n  Services: A Survey",
        "authors": [
            "Najma Taimoor",
            "Semeen Rehman"
        ],
        "summary": "  Recent technological and economic developments have transformed the\nhealthcare sector towards more personalized and IoT-based healthcare services.\nThese services are realized through control and monitoring applications that\nare typically developed using artificial intelligence/machine learning-based\nalgorithms, which play a significant role in highlighting the efficiency of\ntraditional healthcare systems. Current personalized healthcare services are\ndedicated to a specific environment to support technological personalization.\nHowever, they are unable to consider different interrelated health conditions,\nleading to inappropriate diagnoses and affecting sustainability and the\nlong-term health of patients. To this end, current Healthcare 5.0 technology\nhas evolved that supersede previous healthcare technologies. The goal of\nhealthcare 5.0 is to achieve an autonomous healthcare service, that takes into\naccount the interdependent effect of different health conditions of a patient.\nThis paper conducts a comprehensive survey on personalized healthcare services.\nIn particular, we first present an overview of key requirements of\ncomprehensive personalized healthcare services in modern healthcare Internet of\nThings (HIoT), including the definition of personalization and an example use\ncase scenario as a representative for modern HIoT. Second, we explored a\nfundamental three-layer architecture for IoT-based healthcare systems using AI\nand non-AI-based approaches, considering key requirements for CPHS followed by\ntheir strengths and weaknesses in the frame of personalized healthcare\nservices. Third, we highlighted different security threats against each layer\nof IoT architecture along with the possible AI and non-AI-based solutions.\nFinally, we propose a methodology to develop reliable, resilient, and\npersonalized healthcare services that address the identified weaknesses of\nexisting approaches.\n",
        "id": "http://arxiv.org/abs/2209.05457v1",
        "published": "2022-08-29T23:14:02Z"
    },
    {
        "title": "Assessing Fairness in Classification Parity of Machine Learning Models\n  in Healthcare",
        "authors": [
            "Ming Yuan",
            "Vikas Kumar",
            "Muhammad Aurangzeb Ahmad",
            "Ankur Teredesai"
        ],
        "summary": "  Fairness in AI and machine learning systems has become a fundamental problem\nin the accountability of AI systems. While the need for accountability of AI\nmodels is near ubiquitous, healthcare in particular is a challenging field\nwhere accountability of such systems takes upon additional importance, as\ndecisions in healthcare can have life altering consequences. In this paper we\npresent preliminary results on fairness in the context of classification parity\nin healthcare. We also present some exploratory methods to improve fairness and\nchoosing appropriate classification algorithms in the context of healthcare.\n",
        "id": "http://arxiv.org/abs/2102.03717v1",
        "published": "2021-02-07T04:46:27Z"
    },
    {
        "title": "Towards Smart Healthcare: Challenges and Opportunities in IoT and ML",
        "authors": [
            "Munshi Saifuzzaman",
            "Tajkia Nuri Ananna"
        ],
        "summary": "  The COVID-19 pandemic and other ongoing health crises have underscored the\nneed for prompt healthcare services worldwide. The traditional healthcare\nsystem, centered around hospitals and clinics, has proven inadequate in the\nface of such challenges. Intelligent wearable devices, a key part of modern\nhealthcare, leverage Internet of Things technology to collect extensive data\nrelated to the environment as well as psychological, behavioral, and physical\nhealth. However, managing the substantial data generated by these wearables and\nother IoT devices in healthcare poses a significant challenge, potentially\nimpeding decision-making processes. Recent interest has grown in applying data\nanalytics for extracting information, gaining insights, and making predictions.\nAdditionally, machine learning, known for addressing various big data and\nnetworking challenges, has seen increased implementation to enhance IoT systems\nin healthcare. This chapter focuses exclusively on exploring the hurdles\nencountered when integrating ML methods into the IoT healthcare sector. It\noffers a comprehensive summary of current research challenges and potential\nopportunities, categorized into three scenarios: IoT-based, ML-based, and the\nimplementation of machine learning methodologies in the IoT-based healthcare\nindustry. This compilation will assist future researchers, healthcare\nprofessionals, and government agencies by offering valuable insights into\nrecent smart healthcare advancements.\n",
        "id": "http://arxiv.org/abs/2312.05530v2",
        "published": "2024-01-12T14:55:48Z"
    },
    {
        "title": "Meta-learning in healthcare: A survey",
        "authors": [
            "Alireza Rafiei",
            "Ronald Moore",
            "Sina Jahromi",
            "Farshid Hajati",
            "Rishikesan Kamaleswaran"
        ],
        "summary": "  As a subset of machine learning, meta-learning, or learning to learn, aims at\nimproving the model's capabilities by employing prior knowledge and experience.\nA meta-learning paradigm can appropriately tackle the conventional challenges\nof traditional learning approaches, such as insufficient number of samples,\ndomain shifts, and generalization. These unique characteristics position\nmeta-learning as a suitable choice for developing influential solutions in\nvarious healthcare contexts, where the available data is often insufficient,\nand the data collection methodologies are different. This survey discusses\nmeta-learning broad applications in the healthcare domain to provide insight\ninto how and where it can address critical healthcare challenges. We first\ndescribe the theoretical foundations and pivotal methods of meta-learning. We\nthen divide the employed meta-learning approaches in the healthcare domain into\ntwo main categories of multi/single-task learning and many/few-shot learning\nand survey the studies. Finally, we highlight the current challenges in\nmeta-learning research, discuss the potential solutions, and provide future\nperspectives on meta-learning in healthcare.\n",
        "id": "http://arxiv.org/abs/2308.02877v2",
        "published": "2024-06-08T17:02:29Z"
    },
    {
        "title": "Privacy-preserving machine learning for healthcare: open challenges and\n  future perspectives",
        "authors": [
            "Alejandro Guerra-Manzanares",
            "L. Julian Lechuga Lopez",
            "Michail Maniatakos",
            "Farah E. Shamout"
        ],
        "summary": "  Machine Learning (ML) has recently shown tremendous success in modeling\nvarious healthcare prediction tasks, ranging from disease diagnosis and\nprognosis to patient treatment. Due to the sensitive nature of medical data,\nprivacy must be considered along the entire ML pipeline, from model training to\ninference. In this paper, we conduct a review of recent literature concerning\nPrivacy-Preserving Machine Learning (PPML) for healthcare. We primarily focus\non privacy-preserving training and inference-as-a-service, and perform a\ncomprehensive review of existing trends, identify challenges, and discuss\nopportunities for future research directions. The aim of this review is to\nguide the development of private and efficient ML models in healthcare, with\nthe prospects of translating research efforts into real-world settings.\n",
        "id": "http://arxiv.org/abs/2303.15563v1",
        "published": "2023-03-27T19:20:51Z"
    },
    {
        "title": "Federated Learning for Smart Healthcare: A Survey",
        "authors": [
            "Dinh C. Nguyen",
            "Quoc-Viet Pham",
            "Pubudu N. Pathirana",
            "Ming Ding",
            "Aruna Seneviratne",
            "Zihuai Lin",
            "Octavia A. Dobre",
            "Won-Joo Hwang"
        ],
        "summary": "  Recent advances in communication technologies and Internet-of-Medical-Things\nhave transformed smart healthcare enabled by artificial intelligence (AI).\nTraditionally, AI techniques require centralized data collection and processing\nthat may be infeasible in realistic healthcare scenarios due to the high\nscalability of modern healthcare networks and growing data privacy concerns.\nFederated Learning (FL), as an emerging distributed collaborative AI paradigm,\nis particularly attractive for smart healthcare, by coordinating multiple\nclients (e.g., hospitals) to perform AI training without sharing raw data.\nAccordingly, we provide a comprehensive survey on the use of FL in smart\nhealthcare. First, we present the recent advances in FL, the motivations, and\nthe requirements of using FL in smart healthcare. The recent FL designs for\nsmart healthcare are then discussed, ranging from resource-aware FL, secure and\nprivacy-aware FL to incentive FL and personalized FL. Subsequently, we provide\na state-of-the-art review on the emerging applications of FL in key healthcare\ndomains, including health data management, remote health monitoring, medical\nimaging, and COVID-19 detection. Several recent FL-based smart healthcare\nprojects are analyzed, and the key lessons learned from the survey are also\nhighlighted. Finally, we discuss interesting research challenges and possible\ndirections for future FL research in smart healthcare.\n",
        "id": "http://arxiv.org/abs/2111.08834v1",
        "published": "2021-11-16T23:34:22Z"
    },
    {
        "title": "A Novel Zero-Trust Machine Learning Green Architecture for Healthcare\n  IoT Cybersecurity: Review, Analysis, and Implementation",
        "authors": [
            "Zag ElSayed",
            "Nelly Elsayed",
            "Sajjad Bay"
        ],
        "summary": "  The integration of Internet of Things (IoT) devices in healthcare\napplications has revolutionized patient care, monitoring, and data management.\nThe Global IoT in Healthcare Market value is $252.2 Billion in 2023. However,\nthe rapid involvement of these devices brings information security concerns\nthat pose critical threats to patient privacy and the integrity of healthcare\ndata. This paper introduces a novel machine learning (ML) based architecture\nexplicitly designed to address and mitigate security vulnerabilities in IoT\ndevices within healthcare applications. By leveraging advanced convolution ML\narchitecture, the proposed architecture aims to proactively monitor and detect\npotential threats, ensuring the confidentiality and integrity of sensitive\nhealthcare information while minimizing the cost and increasing the portability\nspecialized for healthcare and emergency environments. The experimental results\nunderscore the accuracy of up to 93.6% for predicting various attacks based on\nthe results demonstrate a zero-day detection accuracy simulated using the\nCICIoT2023 dataset and reduces the cost by a factor of x10. The significance of\nour approach is in fortifying the security posture of IoT devices and\nmaintaining a robust implementation of trustful healthcare systems.\n",
        "id": "http://arxiv.org/abs/2401.07368v1",
        "published": "2024-01-14T21:01:21Z"
    },
    {
        "title": "A Study on Quantum Neural Networks in Healthcare 5.0",
        "authors": [
            "Sanjay Chakraborty"
        ],
        "summary": "  The working environment in healthcare analytics is transforming with the\nemergence of healthcare 5.0 and the advancements in quantum neural networks. In\naddition to analyzing a comprehensive set of case studies, we also review\nrelevant literature from the fields of quantum computing applications and smart\nhealthcare analytics, focusing on the implications of quantum deep neural\nnetworks. This study aims to shed light on the existing research gaps regarding\nthe implications of quantum neural networks in healthcare analytics. We argue\nthat the healthcare industry is currently transitioning from automation towards\ngenuine collaboration with quantum networks, which presents new avenues for\nresearch and exploration. Specifically, this study focuses on evaluating the\nperformance of Healthcare 5.0, which involves the integration of diverse\nquantum machine learning and quantum neural network systems. This study also\nexplores a range of potential challenges and future directions for Healthcare\n5.0, particularly focusing on the integration of quantum neural networks.\n",
        "id": "http://arxiv.org/abs/2412.06818v1",
        "published": "2024-12-03T08:14:16Z"
    },
    {
        "title": "Towards better healthcare: What could and should be automated?",
        "authors": [
            "Wolfgang Frühwirt",
            "Paul Duckworth"
        ],
        "summary": "  While artificial intelligence (AI) and other automation technologies might\nlead to enormous progress in healthcare, they may also have undesired\nconsequences for people working in the field. In this interdisciplinary study,\nwe capture empirical evidence of not only what healthcare work could be\nautomated, but also what should be automated. We quantitatively investigate\nthese research questions by utilizing probabilistic machine learning models\ntrained on thousands of ratings, provided by both healthcare practitioners and\nautomation experts. Based on our findings, we present an analytical tool\n(Automatability-Desirability Matrix) to support policymakers and organizational\nleaders in developing practical strategies on how to harness the positive power\nof automation technologies, while accompanying change and empowering\nstakeholders in a participatory fashion.\n",
        "id": "http://arxiv.org/abs/1910.09444v1",
        "published": "2019-10-21T15:23:39Z"
    },
    {
        "title": "Fair Machine Learning in Healthcare: A Review",
        "authors": [
            "Qizhang Feng",
            "Mengnan Du",
            "Na Zou",
            "Xia Hu"
        ],
        "summary": "  The digitization of healthcare data coupled with advances in computational\ncapabilities has propelled the adoption of machine learning (ML) in healthcare.\nHowever, these methods can perpetuate or even exacerbate existing disparities,\nleading to fairness concerns such as the unequal distribution of resources and\ndiagnostic inaccuracies among different demographic groups. Addressing these\nfairness problem is paramount to prevent further entrenchment of social\ninjustices. In this survey, we analyze the intersection of fairness in machine\nlearning and healthcare disparities. We adopt a framework based on the\nprinciples of distributive justice to categorize fairness concerns into two\ndistinct classes: equal allocation and equal performance. We provide a critical\nreview of the associated fairness metrics from a machine learning standpoint\nand examine biases and mitigation strategies across the stages of the ML\nlifecycle, discussing the relationship between biases and their\ncountermeasures. The paper concludes with a discussion on the pressing\nchallenges that remain unaddressed in ensuring fairness in healthcare ML, and\nproposes several new research directions that hold promise for developing\nethical and equitable ML applications in healthcare.\n",
        "id": "http://arxiv.org/abs/2206.14397v3",
        "published": "2024-02-01T05:03:56Z"
    },
    {
        "title": "Review of deep learning in healthcare",
        "authors": [
            "Hasan Hejbari Zargar",
            "Saha Hejbari Zargar",
            "Raziye Mehri"
        ],
        "summary": "  Given the growing complexity of healthcare data over the last several years,\nusing machine learning techniques like Deep Neural Network (DNN) models has\ngained increased appeal. In order to extract hidden patterns and other valuable\ninformation from the huge quantity of health data, which traditional analytics\nare unable to do in a reasonable length of time, machine learning (ML)\ntechniques are used. Deep Learning (DL) algorithms in particular have been\nshown as potential approaches to pattern identification in healthcare systems.\nThis thought has led to the contribution of this research, which examines deep\nlearning methods used in healthcare systems via an examination of cutting-edge\nnetwork designs, applications, and market trends. To connect deep learning\nmethodologies and human healthcare interpretability, the initial objective is\nto provide in-depth insight into the deployment of deep learning models in\nhealthcare solutions. And last, to outline the current unresolved issues and\npotential directions.\n",
        "id": "http://arxiv.org/abs/2310.00727v1",
        "published": "2023-10-01T16:58:20Z"
    },
    {
        "title": "Prediction of Post-Operative Renal and Pulmonary Complications Using\n  Transformers",
        "authors": [
            "Reza Shirkavand",
            "Fei Zhang",
            "Heng Huang"
        ],
        "summary": "  Postoperative complications pose a significant challenge in the healthcare\nindustry, resulting in elevated healthcare expenses and prolonged hospital\nstays, and in rare instances, patient mortality. To improve patient outcomes\nand reduce healthcare costs, healthcare providers rely on various perioperative\nrisk scores to guide clinical decisions and prioritize care. In recent years,\nmachine learning techniques have shown promise in predicting postoperative\ncomplications and fatality, with deep learning models achieving remarkable\nsuccess in healthcare applications. However, research on the application of\ndeep learning models to intra-operative anesthesia management data is limited.\nIn this paper, we evaluate the performance of transformer-based models in\npredicting postoperative acute renal failure, postoperative pulmonary\ncomplications, and postoperative in-hospital mortality. We compare our method's\nperformance with state-of-the-art tabular data prediction models, including\ngradient boosting trees and sequential attention models, on a clinical dataset.\nOur results demonstrate that transformer-based models can achieve superior\nperformance in predicting postoperative complications and outperform\ntraditional machine learning models. This work highlights the potential of deep\nlearning techniques, specifically transformer-based models, in revolutionizing\nthe healthcare industry's approach to postoperative care.\n",
        "id": "http://arxiv.org/abs/2306.00698v2",
        "published": "2023-06-06T16:12:01Z"
    },
    {
        "title": "Machine Learning for Everyone: Simplifying Healthcare Analytics with\n  BigQuery ML",
        "authors": [
            "Mohammad Amir Salari",
            "Bahareh Rahmani"
        ],
        "summary": "  Machine learning (ML) transforms healthcare by enabling predictive analytics,\npersonalized treatments, and improved patient outcomes. However, traditional ML\nworkflows often require specialized skills, infrastructure, and resources,\nlimiting accessibility for many healthcare professionals. This paper explores\nhow BigQuery ML Cloud service helps healthcare researchers and data analysts to\nbuild and deploy models using SQL, without need for advanced ML knowledge. Our\nresults demonstrate that the Boosted Tree model achieved the highest\nperformance among the three models making it highly effective for diabetes\nprediction. BigQuery ML directly integrates predictive analytics into their\nworkflows to inform decision-making and support patient care. We reveal this\ncapability through a case study on diabetes prediction using the Diabetes\nHealth Indicators Dataset. Our study underscores BigQuery ML's role in\ndemocratizing machine learning, enabling faster, scalable, and efficient\npredictive analytics that can directly enhance healthcare decision-making\nprocesses. This study aims to bridge the gap between advanced machine learning\nand practical healthcare analytics by providing detailed insights into BigQuery\nML's capabilities. By demonstrating its utility in a real-world case study, we\nhighlight its potential to simplify complex workflows and expand access to\npredictive tools for a broader audience of healthcare professionals.\n",
        "id": "http://arxiv.org/abs/2502.07026v2",
        "published": "2025-02-21T21:02:55Z"
    },
    {
        "title": "On Healthcare Robots: Concepts, definitions, and considerations for\n  healthcare robot governance",
        "authors": [
            "Eduard Fosch-Villaronga",
            "Hadassah Drukarch"
        ],
        "summary": "  Although healthcare is a remarkably sensitive domain of application, and\nsystems that exert direct control over the world can cause harm in a way that\nhumans cannot necessarily correct or oversee, it is still unclear whether and\nhow healthcare robots are currently regulated or should be regulated. Existing\nregulations are primarily unprepared to provide guidance for such a rapidly\nevolving field and accommodate devices that rely on machine learning and AI.\nMoreover, the field of healthcare robotics is very rich and extensive, but it\nis still very much scattered and unclear in terms of definitions, medical and\ntechnical classifications, product characteristics, purpose, and intended use.\nAs a result, these devices often navigate between the medical device regulation\nor other non-medical norms, such as the ISO personal care standard. Before\nregulating the field of healthcare robots, it is therefore essential to map the\nmajor state-of-the-art developments in healthcare robotics, their capabilities\nand applications, and the challenges we face as a result of their integration\nwithin the healthcare environment.\n  This contribution fills in this gap and lack of clarity currently experienced\nwithin healthcare robotics and its governance by providing a structured\noverview of and further elaboration on the main categories now established,\ntheir intended purpose, use, and main characteristics. We explicitly focus on\nsurgical, assistive, and service robots to rightfully match the definition of\nhealthcare as the organized provision of medical care to individuals, including\nefforts to maintain, treat, or restore physical, mental, or emotional\nwell-being. We complement these findings with policy recommendations to help\npolicymakers unravel an optimal regulatory framing for healthcare robot\ntechnologies\n",
        "id": "http://arxiv.org/abs/2106.03468v1",
        "published": "2021-06-07T09:51:02Z"
    },
    {
        "title": "A multiagent based framework secured with layered SVM-based IDS for\n  remote healthcare systems",
        "authors": [
            "Mohammadreza Begli",
            "Farnaz Derakhshan"
        ],
        "summary": "  Since the number of elderly and patients who are in hospitals and healthcare\ncenters are growing, providing efficient remote healthcare services seems very\nimportant. Currently, most such systems benefit from the distribution and\nautonomy features of multiagent systems and the structure of wireless sensor\nnetworks. On the one hand, securing the data of remote healthcare systems is\none of the most significant concerns; particularly recent types of research\nabout the security of remote healthcare systems keep them secure from\neavesdropping and data modification. On the other hand, existing remote\nhealthcare systems are still vulnerable against other common attacks of\nhealthcare networks such as Denial of Service (DoS) and User to Root (U2R)\nattacks, because they are managed remotely and based on the Internet.\nTherefore, in this paper, we propose a secure framework for remote healthcare\nsystems that consists of two phases. First, we design a healthcare system base\non multiagent technology to collect data from a sensor network. Then, in the\nsecond phase, a layered architecture of intrusion detection systems that uses\nSupport Vector Machine to learn the behavior of network traffic is applied.\nBased on our framework, we implement a secure remote healthcare system and\nevaluate this system against the frequent attacks of healthcare networks such\nas Smurf, Buffer overflow, Neptune, and Pod attacks. In the end, evaluation\nparameters of the layered architecture of intrusion detection systems prove the\nefficiency and correctness of our proposed framework.\n",
        "id": "http://arxiv.org/abs/2104.06498v1",
        "published": "2021-04-13T20:34:38Z"
    },
    {
        "title": "A Secure Healthcare 5.0 System Based on Blockchain Technology Entangled\n  with Federated Learning Technique",
        "authors": [
            "Abdur Rehman",
            "Sagheer Abbas",
            "M. A. Khan",
            "Taher M. Ghazal",
            "Khan Muhammad Adnan",
            "Amir Mosavi"
        ],
        "summary": "  In recent years, the global Internet of Medical Things (IoMT) industry has\nevolved at a tremendous speed. Security and privacy are key concerns on the\nIoMT, owing to the huge scale and deployment of IoMT networks. Machine learning\n(ML) and blockchain (BC) technologies have significantly enhanced the\ncapabilities and facilities of healthcare 5.0, spawning a new area known as\n\"Smart Healthcare.\" By identifying concerns early, a smart healthcare system\ncan help avoid long-term damage. This will enhance the quality of life for\npatients while reducing their stress and healthcare costs. The IoMT enables a\nrange of functionalities in the field of information technology, one of which\nis smart and interactive health care. However, combining medical data into a\nsingle storage location to train a powerful machine learning model raises\nconcerns about privacy, ownership, and compliance with greater concentration.\nFederated learning (FL) overcomes the preceding difficulties by utilizing a\ncentralized aggregate server to disseminate a global learning model.\nSimultaneously, the local participant keeps control of patient information,\nassuring data confidentiality and security. This article conducts a\ncomprehensive analysis of the findings on blockchain technology entangled with\nfederated learning in healthcare. 5.0. The purpose of this study is to\nconstruct a secure health monitoring system in healthcare 5.0 by utilizing a\nblockchain technology and Intrusion Detection System (IDS) to detect any\nmalicious activity in a healthcare network and enables physicians to monitor\npatients through medical sensors and take necessary measures periodically by\npredicting diseases.\n",
        "id": "http://arxiv.org/abs/2209.09642v1",
        "published": "2022-09-16T23:25:42Z"
    },
    {
        "title": "Multimodal Federated Learning in Healthcare: a Review",
        "authors": [
            "Jacob Thrasher",
            "Alina Devkota",
            "Prasiddha Siwakotai",
            "Rohit Chivukula",
            "Pranav Poudel",
            "Chaunbo Hu",
            "Binod Bhattarai",
            "Prashnna Gyawali"
        ],
        "summary": "  Recent advancements in multimodal machine learning have empowered the\ndevelopment of accurate and robust AI systems in the medical domain, especially\nwithin centralized database systems. Simultaneously, Federated Learning (FL)\nhas progressed, providing a decentralized mechanism where data need not be\nconsolidated, thereby enhancing the privacy and security of sensitive\nhealthcare data. The integration of these two concepts supports the ongoing\nprogress of multimodal learning in healthcare while ensuring the security and\nprivacy of patient records within local data-holding agencies. This paper\noffers a concise overview of the significance of FL in healthcare and outlines\nthe current state-of-the-art approaches to Multimodal Federated Learning (MMFL)\nwithin the healthcare domain. It comprehensively examines the existing\nchallenges in the field, shedding light on the limitations of present models.\nFinally, the paper outlines potential directions for future advancements in the\nfield, aiming to bridge the gap between cutting-edge AI technology and the\nimperative need for patient data privacy in healthcare applications.\n",
        "id": "http://arxiv.org/abs/2310.09650v2",
        "published": "2024-02-27T17:16:59Z"
    },
    {
        "title": "An Overview and Case Study of the Clinical AI Model Development Life\n  Cycle for Healthcare Systems",
        "authors": [
            "Charles Lu",
            "Julia Strout",
            "Romane Gauriau",
            "Brad Wright",
            "Fabiola Bezerra De Carvalho Marcruz",
            "Varun Buch",
            "Katherine Andriole"
        ],
        "summary": "  Healthcare is one of the most promising areas for machine learning models to\nmake a positive impact. However, successful adoption of AI-based systems in\nhealthcare depends on engaging and educating stakeholders from diverse\nbackgrounds about the development process of AI models. We present a broadly\naccessible overview of the development life cycle of clinical AI models that is\ngeneral enough to be adapted to most machine learning projects, and then give\nan in-depth case study of the development process of a deep learning based\nsystem to detect aortic aneurysms in Computed Tomography (CT) exams. We hope\nother healthcare institutions and clinical practitioners find the insights we\nshare about the development process useful in informing their own model\ndevelopment efforts and to increase the likelihood of successful deployment and\nintegration of AI in healthcare.\n",
        "id": "http://arxiv.org/abs/2003.07678v3",
        "published": "2020-03-26T21:03:35Z"
    }
]